documents/images/graphio/stdlib/convert_color3_material.dot
digraph {
  rankdir = LR;
    NG_convert_color3_material_surfacematerial [label= "surfacematerial"];
    NG_convert_color3_material_surfacematerial[shape = box];
    NG_convert_color3_material_surfacematerial ->     NG_convert_color3_material_out;
    NG_convert_color3_material_out [label= "out"];
    NG_convert_color3_material_out[shape = box]; 
    NG_convert_color3_material_surface_unlit [label= "surface_unlit"];
    NG_convert_color3_material_surface_unlit[shape = box];
    NG_convert_color3_material_surface_unlit ->     NG_convert_color3_material_surfacematerial [label= "surfaceshader"];
    NG_convert_color3_material_surfacematerial [label= "surfacematerial"];
    NG_convert_color3_material_surfacematerial[shape = box]; 
    NG_convert_color3_material_inINT [label="in"];
    NG_convert_color3_material_inINT [shape = ellipse];
    NG_convert_color3_material_surface_unlit [label="surface_unlit"];
    NG_convert_color3_material_inINT -> NG_convert_color3_material_surface_unlit [label=".emission_color"];
}
